report_clocks
after [expr 3 * 1000]
report_timing
time_design -report_only
